const palette = {
  red: [
    '#c23d38', // 빨간버튼 기본색
    '#BF0404', // 빨간버튼 호버색
    '#dc6857', // 게시글 눌린 하트색상
    '#E60023', // 로그인 버튼 밝은 빨간색
    '#ffdadf', // 좋아요 클릭 시 연한 핑크
  ],
  gray: [
    '#e9e9e9', // 회색버튼 기본색, 인풋 보더색상
    '#e2e2e2', // 회색버튼 호버색
    '#e9e9e9', // 흰색버튼 호버색
    '#767676', // UI아이콘, 별명 표시 등 회색글씨 색
    '#f1f1f1', // 검색바색
    '#e1e1e1', // 검색바 호버색, 사진 업로드 박스 색
    '#dadada', // 사진 업로드 박스 보더색
  ],
  black: [
    '#111', // 인풋 글씨색
    '#211922', // 인풋 라벨 글씨색
  ],
  blue: [
    '#1877F2', // facebook 로그인 버튼
  ],

  profile: ['#E60023', '#767676', '#1877F2', '#00563f', '#ff6f00', '#371f76', '#ffef00', '#000', '#889970', '#16a7a1'],
};

export default palette;
